"use client";

import { Accordion, AccordionItem } from "@nextui-org/react";
import s from "./style.module.scss";

export function FaqAccordion() {
  const defaultContent =
    "ОписОп исО писО писО писОп исОп исОписОп ЫисОпи сОписОпи сОпи сОп исОпис ОписОп исОпис ОписО писОп исОписОп исОп исО писОп исО пис ОписО писОпис исОпис ОписО писОп исОписОп исОп исО писОп исО пис ОписО писОпис исОпис ОписО писОп исОписОп исОп исО писОп исО пис ОписО писОпис ОписОп исО писО писО писОп исОп исОписОп ЫисОпи сОписОпи сОпи сОп исОпис ОписОп исОпис ОписО писОп исОписОп исОп исО писОп исО пис ОписО писОпис исОпис ОписО писОп исОписОп исОп исО писОп исО пис ОписО писОпис исОпис ОписО писОп исОписОп исОп исО писОп исО пис ОписО писОписОписОп исО писО писО писОп исОп исОписОп ЫисОпи сОписОпи сОпи сОп исОпис ОписОп исОпис ОписО писОп исОписОп исОп исО писОп исО пис ОписО писОпис исОпис ОписО писОп исОписОп исОп исО писОп исО пис ОписО писОпис исОпис ОписО писОп исОписОп исОп исО писОп исО пис ОписО писОписОписОп исО писО писО писОп исОп исОписОп ЫисОпи сОписОпи сОпи сОп исОпис ОписОп исОпис ОписО писОп исОписОп исОп исО писОп исО пис ОписО писОпис исОпис ОписО писОп исОписОп исОп исО писОп исО пис ОписО писОпис исОпис ОписО писОп исОписОп исОп исО писОп исО пис ОписО писОпис";

  return (
    <Accordion
      className={s.accordionBase}
      itemClasses={{
        base: s.base,
        content: s.content,
        heading: s.heading,
        trigger: s.trigger,
        title: s.title,
      }}
      hideIndicator={true}
    >
      <AccordionItem
        key="1"
        aria-label="Accordion 1"
        title="Як зареєструватися?"
      >
        {
          "Для реєстрації в нашій онлайн IT-школі, перейдіть на наш веб-сайт та скористайтеся формою реєстрації. Або напишіть нашому Адміну в Instagram або Telegram"
        }
      </AccordionItem>
      <AccordionItem
        key="2"
        aria-label="Accordion 1"
        title="Які інтернет-технології використовуються для навчання?"
      >
        {
          "Наша школа використовує високоякісне онлайн-забезпечення для проведення уроків, вебінарів та взаємодії з викладачами. Ми використовуємо платформи відомих виробників, таких як Zoom, Microsoft Teams або Google Meet"
        }
      </AccordionItem>
      <AccordionItem
        key="3"
        aria-label="Accordion 1"
        title="Як отримати доступ до навчальних матеріалів?"
      >
        {
          "Після реєстрації ви отримаєте особистий обліковий запис, де будуть доступні навчальні матеріали, завдання та інші ресурси. Детальні інструкції будуть висвітлені під час першого уроку."
        }
      </AccordionItem>
      <AccordionItem
        key="4"
        aria-label="Accordion 1"
        title="Чи потрібно встановлювати спеціальне програмне забезпечення для участі в уроках?"
      >
        {
          "Для більшості наших курсів вам достатньо мати стандартний веб-браузер та доступ до Інтернету. У деяких випадках може бути рекомендовано встановлення додаткових інструментів, інформацію про які ви отримаєте під час реєстрації."
        }
      </AccordionItem>
      <AccordionItem
        key="5"
        aria-label="Accordion 1"
        title="Як контролюється академічний прогрес студентів?"
      >
        {
          "Прогрес студентів контролюється через онлайн-платформу, де вони можуть переглядати свої оцінки, завдання та спілкуватися з викладачами. Регулярні звіти також надсилаються на електронну пошту."
        }
      </AccordionItem>
      <AccordionItem
        key="6"
        aria-label="Accordion 1"
        title="Як звертатися за допомогою в разі технічних проблем?"
      >
        {
          "У випадку технічних проблем чи запитань щодо використання платформи, звертайтеся до нашого Адміна  в Instagram або Telegram"
        }
      </AccordionItem>
      <AccordionItem
        key="7"
        aria-label="Accordion 1"
        title="Чи є можливість отримати консультації з вибору курсів чи програм?"
      >
        {
          "Так, ми пропонуємо консультації для допомоги вибрати відповідні курси чи програми. Запишіться на індивідуальну консультацію через наш веб-сайт або ж отримайте констультацію у адміна в Instagram або Telegram"
        }
      </AccordionItem>
    </Accordion>
  );
}
